Саракташ2/src/InformationRegisters/ТоварыПоКатегориям/ТоварыПоКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыПоКатегориям</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаличия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьЭтикетку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварИзРеестраНХП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеЦеныЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОптРазрезыЗначения</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>EnumRef.ОптРазрезыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПохожиеРозничныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МастерицыДляПроверки</name>
    <attributes>
      <name>Мастерица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизиты/ДополнительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизиты</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляКатегорий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Саракташ2/src/CommonModules/УправлениеДопРеквизитами/Module.bsl
Процедура ЗаполнитьДополнительныеРеквизиты(Знач Ссылка,Знач Форма,Знач Расположение,АдресКэша, тзЗначенияНовогоОбъекта=Неопределено) Экспорт
	
	ТаблицаДопРеквизитов = ТаблицаДополнительныхРеквизитов(Ссылка);
	
	Если НЕ ПустаяСтрока(АдресКэша) Тогда
		КэшДопРеквизитов = ПолучитьИзВременногоХранилища(АдресКэша);
	Иначе
		КэшДопРеквизитов = Новый Структура; 
	КонецЕсли;	  
		
	// {удаление добавленных ранее доп. реквизитов и элементов
	Если КэшДопРеквизитов.Свойство("ДобавленныеРеквизиты") Тогда	
		
		Форма.ИзменитьРеквизиты(,КэшДопРеквизитов.ДобавленныеРеквизиты);
		Для Каждого Эл Из КэшДопРеквизитов.ДобавленныеРеквизиты Цикл
			Форма.Элементы.Удалить(Форма.Элементы[Эл]);
		КонецЦикла;
		
	КонецЕсли; 
	// удаление добавленных ранее доп. реквизитов и элементов}
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавленныеРеквизиты = Новый Массив;
	КлючиСвойств = Новый Соответствие;
	ЗначенияСвойств = Новый Соответствие;
	Для Каждого Стр Из ТаблицаДопРеквизитов Цикл			
		
		Ключ = КлючИзСсылки(Стр.Ссылка);
		Стр.Ключ = Ключ;
		НовыйРеквизит = Новый РеквизитФормы(Ключ,Стр.ТипЗначения,"",,Истина);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		ДобавленныеРеквизиты.Добавить(Ключ); 
		КлючиСвойств.Вставить(Ключ,Стр.Ссылка);
		ЗначенияСвойств.Вставить(Стр.Ссылка,Стр.ЗначениеПоля);
		
	КонецЦикла; 	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	КэшДопРеквизитов.Вставить("ДобавленныеРеквизиты",ДобавленныеРеквизиты);
	КэшДопРеквизитов.Вставить("КлючиСвойств",КлючиСвойств); 
	КэшДопРеквизитов.Вставить("ЗначенияСвойств",ЗначенияСвойств);   
	
	Для Каждого Стр Из ТаблицаДопРеквизитов Цикл 		
		
		НовыйЭлемент = Форма.Элементы.Добавить(Стр.Ключ,Тип("ПолеФормы"),Расположение); 
		НовыйЭлемент.ПутьКДанным = Стр.Ключ;
		НовыйЭлемент.Заголовок = Стр.Наименование;
		НовыйЭлемент.ОграничениеТипа = Стр.ТипЗначения;
		
		Если Стр.ТипЗначения.Типы().Количество() > 1 Тогда
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		Иначе
			Если Стр.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;				
			КонецЕсли;
		КонецЕсли;	 
		
		Если Стр.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДополнительныеЗначенияРеквизитов")) Тогда			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Стр.Ссылка);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			НовыйЭлемент.ПараметрыВыбора = НовыеПараметры;
			//НовыйЭлемент.БыстрыйВыбор = Истина; 
			НовыйЭлемент.ВысотаСпискаВыбора = 5; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Стр.ЗначениеПоля) Тогда
			Форма[Стр.Ключ] = Стр.ЗначениеПоля;
		КонецЕсли;
		
		Если тзЗначенияНовогоОбъекта <> Неопределено Тогда	//Когда создается новый объект и необходимо заполнить свойства то передаем ТЗ с нужными значениями и запоняем с-ва тут
			
			мсСтроки = тзЗначенияНовогоОбъекта.НайтиСтроки(Новый Структура("Свойство", Стр.Ссылка));
			Если мсСтроки.Количество() > 0 Тогда
				
				Форма[Стр.Ключ] = мсСтроки[0].Значение;
				
			КонецЕсли;			
			
		КонецЕсли;
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении","ДополнительныйРеквизитПриИзменении"); 		
		НовыйЭлемент.РастягиватьПоГоризонтали=Ложь;
		НовыйЭлемент.Ширина = 25;
								
	КонецЦикла;
	
	АдресКэша = ПоместитьВоВременноеХранилище(КэшДопРеквизитов,Форма.УникальныйИдентификатор);
	
КонецПроцедуры

Функция КлючИзСсылки(Ссылка)
	
	Ключ = Строка(Ссылка.УникальныйИдентификатор());
	Ключ = СтрЗаменить(Ключ,"-","_");
	Возврат "др"+Ключ;
	
КонецФункции

Процедура ПриИзмененииДополнительногоРеквизита(Знач Ключ,Знач НовоеЗначение,Знач АдресКэша) Экспорт
	
	КэшДопРеквизитов = ПолучитьИзВременногоХранилища(АдресКэша);
	КэшДопРеквизитов.ЗначенияСвойств[КэшДопРеквизитов.КлючиСвойств[Ключ]] = НовоеЗначение;
	ПоместитьВоВременноеХранилище(КэшДопРеквизитов,АдресКэша);		
	
КонецПроцедуры

Функция ТаблицаДополнительныхРеквизитов(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение
	|ПОМЕСТИТЬ ЗначенияПолей
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоКатегориям.Категория
	|ПОМЕСТИТЬ Категории
	|ИЗ
	|	РегистрСведений.ТоварыПоКатегориям КАК ТоварыПоКатегориям
	|ГДЕ
	|	ТоварыПоКатегориям.Номенклатура = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДопРеквизиты
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	НЕ ДополнительныеРеквизиты.ПометкаУдаления
	|	И НЕ ДополнительныеРеквизиты.ТолькоДляКатегорий
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыКатегории.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизиты.Категории КАК ДополнительныеРеквизитыКатегории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Категории КАК Категории
	|		ПО ДополнительныеРеквизитыКатегории.Категория = Категории.Категория
	|			И (НЕ ДополнительныеРеквизитыКатегории.Ссылка.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопРеквизиты.Ссылка КАК Ссылка,
	|	ДопРеквизиты.Ссылка.ТипЗначения КАК ТипЗначения,
	|	ДопРеквизиты.Ссылка.ОбязательноеЗаполнение КАК ОбязательноеЗаполнение,
	|	ДопРеквизиты.Ссылка.Наименование КАК Наименование,
	|	ЕСТЬNULL(ЗначенияПолей.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеПоля,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Ключ
	|ИЗ
	|	ДопРеквизиты КАК ДопРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПолей КАК ЗначенияПолей
	|		ПО ДопРеквизиты.Ссылка = ЗначенияПолей.Свойство где выбор когда &ИспользоватьмсОграничение = истина тогда ДопРеквизиты.Ссылка в(&мсОграничение) иначе истина конец 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	мсОграничение = Новый Массив;
	
	//Для оптовых товаров
	ГруппаОпт = Справочники.Номенклатура.НайтиПоКоду("000010000");	//Опт
	Если Ссылка.ЭтоГруппа И (Ссылка = ГруппаОпт Или Ссылка.Родитель = ГруппаОпт Или Ссылка.Родитель.Родитель = ГруппаОпт Или Ссылка.Родитель.Родитель.Родитель = ГруппаОпт) Тогда
		мсОграничение.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоКоду("000000004"));	//Состав
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мсОграничение", мсОграничение);
	Запрос.УстановитьПараметр("ИспользоватьмсОграничение", мсОграничение.Количество() > 0);
	
	ТаблицаДопРеквизитов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДопРеквизитов;
	
КонецФункции

Процедура ЗаписатьДополнительныеРеквизиты(Объект,АдресКэша) Экспорт
	
	КэшДопРеквизитов = ПолучитьИзВременногоХранилища(АдресКэша);
	Объект.ДополнительныеРеквизиты.Очистить();
	Для Каждого КлючЗначение Из КэшДопРеквизитов.ЗначенияСвойств Цикл
		нс = Объект.ДополнительныеРеквизиты.Добавить();
		нс.Свойство = КлючЗначение.Ключ;
		нс.Значение = КлючЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

Функция СписокВсехДополнительныхРеквизитов() Экспорт
	
	Список = Новый СписокЗначений;
	Выборка = ПланыВидовХарактеристик.ДополнительныеРеквизиты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Список.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции
